Revit 2027 API
ElementIsCurveDrivenFilter Constructor
 Constructs a new instance of a filter to match only curve driven elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIsCurveDrivenFilter()
Public Sub New
public:
ElementIsCurveDrivenFilter()
new : unit -> ElementIsCurveDrivenFilter
Remarks
 The term "curve driven" indicates that the element's Location property is a LocationCurve. Example elements found by this filter include walls, beams, and curve elements.
See Also
Reference
ElementIsCurveDrivenFilter Class
ElementIsCurveDrivenFilter Overload
Autodesk.Revit.DB Namespace